Кафе/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <basedOn>Document.ТабельУчетаРабочегоВремени</basedOn>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удержано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыплаты</name>
    <type>
      <types>EnumRef.ВидВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПочасоваяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвансВыработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗарплатаВыработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>УдержаноИзЗп</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПФР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФСС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Кафе/src/Enums/ВидВыплаты/ВидВыплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидВыплаты</name>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
</mdclass:Enum>

Кафе/src/Documents/НачислениеЗарплаты/Forms/ФормаДокументаНачислениеЗарплаты/Module.bsl
&НаСервере
Функция ПолучитьВидВыплатыЗарплата()
    Возврат Перечисления.ВидВыплаты.Зарплата;
КонецФункции

&НаСервере
Функция ПолучитьВидВыплатыАванс()
    Возврат Перечисления.ВидВыплаты.Аванс;
КонецФункции

&НаКлиенте
Процедура ВидВыплатыПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Зарплата.ТекущиеДанные;
	Если Объект.ВидВыплаты = ПолучитьВидВыплатыАванс() Тогда
		Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
			СтрокаТЧ.Выработка = СтрокаТЧ.АвансВыработка;
		КонецЦикла;
	ИначеЕсли Объект.ВидВыплаты =ПолучитьВидВыплатыЗарплата() Тогда
		Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
			СтрокаТЧ.Выработка = СтрокаТЧ.ЗарплатаВыработка;
			КонецЦикла;
	КонецЕсли;
	РасчетНачисленоИтого(СтрокаТЧ);
	РасчитатьНачислено(СтрокаТЧ);
	ЗаполнениеТЧУдержания (СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура РасчетНачисленоИтого(СтрокаТЧ)
	Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
		СтрокаТЧ.НачисленоИтого = СтрокаТЧ.Выработка * СтрокаТЧ.ПочасоваяСтавка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьНачислено(СтрокаТЧ)
	Объект.Начислено = 0;
	Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
		Объект.Начислено = Объект.Начислено + СтрокаТЧ.НачисленоИтого;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеТЧУдержания(СтрокаТЧ)
	СтрокаТЧУдержания = Элементы.Удержания1.ТекущаяСтрока;
	Для Каждого СтрокаТЧУдержания Из Объект.Удержания Цикл
		Для Каждого СтрокаТЧ из Объект.Зарплата Цикл
			СтрокаТЧУдержания.НДФЛ = СтрокаТЧ.НачисленоИтого * 13 / 100;
			СтрокаТЧУдержания.ПФР = СтрокаТЧ.НачисленоИтого * 22 / 100;
			СтрокаТЧУдержания.ФСС = СтрокаТЧ.НачисленоИтого * 2.9 / 100;
			СтрокаТЧУдержания.УдержаноИзЗП = СтрокаТЧУдержания.НДФЛ + СтрокаТЧУдержания.ПФР + СтрокаТЧУдержания.ФСС;  
		КонецЦикла;
	КонецЦикла;
	РасчитатьУдержано(СтрокаТЧУдержания);
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьУдержано(СтрокаТЧУдержания)
	Объект.Удержано = 0;
	Для Каждого СтрокаТЧУдержания из Объект.Удержания Цикл
		Объект.Удержано = Объект.Удержано + СтрокаТЧУдержания.УдержаноИзЗп;
	КонецЦикла;
КонецПроцедуры
